Fixing mermaid format
